# Используем официальный образ Python
FROM python:3.12

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем все файлы из текущей директории на хосте в контейнер
COPY . .

# Устанавливаем зависимости из файла requirements.txt
RUN pip install --no-cache-dir -r requirements.txt

# Экспонируем порт, на котором будет работать приложение (по умолчанию FastAPI работает на порту 8000)
EXPOSE 8000

# Запускаем приложение с помощью uvicorn
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]